# SpotElevRotateWithComponent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotElevRotateWithComponent Property
ParameterTypeId Class See Also
---
"Rotate with Component"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotElevRotateWithComponent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotElevRotateWithComponent As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotElevRotateWithComponent {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace